app/Controllers/Dashboard.php

SELECT SUM(`jumlah`) AS `total`
FROM `transactions`
WHERE `user_id` = '5'
AND `tipe_transaksi` = 'pemasukan'
AND `tanggal_transaksi` >= '2025-06-01'
AND `tanggal_transaksi` <= '2025-06-30'
SELECT SUM(`jumlah`) AS `total`
FROM `transactions`
WHERE `user_id` = '5'
AND `tipe_transaksi` = 'pengeluaran'
AND `tanggal_transaksi` >= '2025-06-01'
AND `tanggal_transaksi` <= '2025-06-30'
SELECT SUM(`saldo`) AS `total`
FROM `wallets`
WHERE `user_id` = '5'
---
    public function index()
    {
        if (!session()->has('user_id')) {
            return view('dashboardGuest');
        }

        $userId = session()->get('user_id');
        $db = \Config\Database::connect();
        $transactionModel = new \App\Models\TransactionModel();

        // ===================================================================
        // [PERUBAHAN] 1. LOGIKA UNTUK FILTER KARTU RINGKASAN
        // ===================================================================
        $filter_kartu = [
            'tanggal_awal'  => $this->request->getGet('kartu_tanggal_awal'),
            'tanggal_akhir' => $this->request->getGet('kartu_tanggal_akhir'),
        ];

        // Default untuk filter kartu adalah bulan ini
        $tglAwalKartu = !empty($filter_kartu['tanggal_awal']) ? $filter_kartu['tanggal_awal'] : date('Y-m-01');
        $tglAkhirKartu = !empty($filter_kartu['tanggal_akhir']) ? $filter_kartu['tanggal_akhir'] : date('Y-m-t');

        // Query Pemasukan berdasarkan filter kartu
        $pemasukan = $db->table('transactions')
                        ->where('user_id', $userId)
                        ->where('tipe_transaksi', 'pemasukan')
                        ->where('tanggal_transaksi >=', $tglAwalKartu)
                        ->where('tanggal_transaksi <=', $tglAkhirKartu)
                        ->selectSum('jumlah', 'total')->get()->getRow()->total ?? 0;

        // Query Pengeluaran berdasarkan filter kartu
        $pengeluaran = $db->table('transactions')
                         ->where('user_id', $userId)
                         ->where('tipe_transaksi', 'pengeluaran')
                         ->where('tanggal_transaksi >=', $tglAwalKartu)
                         ->where('tanggal_transaksi <=', $tglAkhirKartu)
                         ->selectSum('jumlah', 'total')->get()->getRow()->total ?? 0;

        // Total Saldo Dompet (ini tetap keseluruhan, tidak terpengaruh filter)
        $totalSaldo = $db->table('wallets')
                         ->where('user_id', $userId)
                         ->selectSum('saldo', 'total')->get()->getRow()->total ?? 0;