app/Controllers/Transaksi.php

SELECT *
FROM `wallets`
WHERE `user_id` = '3'
SELECT *
FROM `categories`
WHERE `user_id` = '3'
---
    public function index()
    {
        $transactionModel = new TransactionModel();
        $walletModel = new WalletModel();
        $categoryModel = new CategoryModel();
        $userId = session()->get('user_id');

        // Mengambil data filter dari URL (GET request)
        $filter = [
            'tanggal_awal'  => $this->request->getGet('tanggal_awal'),
            'tanggal_akhir' => $this->request->getGet('tanggal_akhir'),
        ];

        // Jika tidak ada filter, set default 1 bulan terakhir
        if (empty($filter['tanggal_awal']) && empty($filter['tanggal_akhir'])) {
            $filter['tanggal_awal'] = date('Y-m-01'); // Tanggal 1 bulan ini
            $filter['tanggal_akhir'] = date('Y-m-t'); // Tanggal terakhir bulan ini
        }

        // Siapkan data untuk dikirim ke model
        $filtersForQuery = [
            'user_id'       => $userId,
            'tanggal_awal'  => $filter['tanggal_awal'],
            'tanggal_akhir' => $filter['tanggal_akhir'],
        ];

        $data = [
            'transactions' => $transactionModel->getTransactions($filtersForQuery),
            'wallets'      => $walletModel->where('user_id', $userId)->findAll(),
            'categories'   => $categoryModel->where('user_id', $userId)->findAll(),

SELECT *
FROM `transactions`
WHERE `id` = '3'
AND `user_id` = '3'
 LIMIT 1
DELETE FROM `transactions`
WHERE `id` IN ('3')
---
public function delete($id = null)
{
    $transactionModel = new \App\Models\TransactionModel();
    $userId = session()->get('user_id');

    // Cari transaksi berdasarkan ID dan pastikan itu milik user yang login
    $transaction = $transactionModel->where(['id' => $id, 'user_id' => $userId])->first();

    if ($transaction) {
        // Jika ditemukan, hapus. Trigger di database akan otomatis mengupdate saldo dompet.
        $transactionModel->delete($id);