app/Controllers/Wallet.php

    public function index()
    {
        $walletModel = new WalletModel();
        $userId = session()->get('user_id');

        $data = [
            'wallets' => $walletModel->where('user_id', $userId)->findAll(),
        ];
---
SELECT *
FROM `wallets`
WHERE `user_id` = '3'