app/Models/DiagramModel.php

SELECT `categories`.`nama_kategori`, SUM(transactions.jumlah) as total
FROM `transactions`
JOIN `categories` ON `categories`.`id` = `transactions`.`category_id`
WHERE `transactions`.`user_id` = '4'
AND `transactions`.`tipe_transaksi` = 'pengeluaran'
AND `transactions`.`tanggal_transaksi` >= '2025-06-01'
AND `transactions`.`tanggal_transaksi` <= '2025-06-30'
GROUP BY `transactions`.`category_id`
ORDER BY `total` DESC
---
    public function getExpenseByCategory(array $filters = [])
    {
        $builder = $this->db->table('transactions');
        $builder->select('categories.nama_kategori, SUM(transactions.jumlah) as total');
        $builder->join('categories', 'categories.id = transactions.category_id');

        // Filter wajib
        $builder->where('transactions.user_id', $filters['user_id']);
        $builder->where('transactions.tipe_transaksi', 'pengeluaran');

        // Filter tanggal jika ada
        if (!empty($filters['tanggal_awal'])) {
            $builder->where('transactions.tanggal_transaksi >=', $filters['tanggal_awal']);
        }
        if (!empty($filters['tanggal_akhir'])) {
            $builder->where('transactions.tanggal_transaksi <=', $filters['tanggal_akhir']);
        }

        $builder->groupBy('transactions.category_id');
        $builder->orderBy('total', 'DESC');

        return $builder->get()->getResultArray();

SELECT DATE_FORMAT(tanggal_transaksi, '%Y-%m-%d') as tanggal, SUM(CASE WHEN tipe_transaksi = 'pemasukan' THEN jumlah ELSE 0 END) as total_pemasukan, SUM(CASE WHEN tipe_transaksi = 'pengeluaran' THEN jumlah ELSE 0 END) as total_pengeluaran
FROM `transactions`
WHERE `user_id` = '4'
AND `tanggal_transaksi` >= '2025-06-01'
AND `tanggal_transaksi` <= '2025-06-30'
GROUP BY `tanggal`
ORDER BY `tanggal` ASC
---
    public function getDailyTrend(array $filters = [])
    {
        $builder = $this->db->table('transactions');
        $builder->select("
            DATE_FORMAT(tanggal_transaksi, '%Y-%m-%d') as tanggal,
            SUM(CASE WHEN tipe_transaksi = 'pemasukan' THEN jumlah ELSE 0 END) as total_pemasukan,
            SUM(CASE WHEN tipe_transaksi = 'pengeluaran' THEN jumlah ELSE 0 END) as total_pengeluaran
        ");

        // Filter wajib
        $builder->where('user_id', $filters['user_id']);

        // Filter tanggal jika ada
        if (!empty($filters['tanggal_awal'])) {
            $builder->where('tanggal_transaksi >=', $filters['tanggal_awal']);
        }
        if (!empty($filters['tanggal_akhir'])) {
            $builder->where('tanggal_transaksi <=', $filters['tanggal_akhir']);
        }

        $builder->groupBy('tanggal');
        $builder->orderBy('tanggal', 'ASC');

        return $builder->get()->getResultArray();