app/Models/TransactionModel.php

SELECT `transactions`.*, `categories`.`nama_kategori`, `wallets`.`nama_dompet`
FROM `transactions`
JOIN `categories` ON `categories`.`id` = `transactions`.`category_id`
JOIN `wallets` ON `wallets`.`id` = `transactions`.`wallet_id`
WHERE `transactions`.`user_id` = '5'
AND `transactions`.`tanggal_transaksi` >= '2025-05-14'
AND `transactions`.`tanggal_transaksi` <= '2025-06-13'
ORDER BY `transactions`.`tanggal_transaksi` DESC, `transactions`.`id` DESC
---
public function getTransactions(array $filters = []): array
{
    $builder = $this->db->table($this->table);

    // Selalu join dengan kategori dan wallet untuk mendapatkan nama
    $builder->select('transactions.*, categories.nama_kategori, wallets.nama_dompet');
    $builder->join('categories', 'categories.id = transactions.category_id');
    $builder->join('wallets', 'wallets.id = transactions.wallet_id');

    // Filter wajib berdasarkan user yang login
    if (isset($filters['user_id'])) {
        $builder->where('transactions.user_id', $filters['user_id']);
    }

    // Filter berdasarkan rentang tanggal
    if (isset($filters['tanggal_awal']) && !empty($filters['tanggal_awal'])) {
        $builder->where('transactions.tanggal_transaksi >=', $filters['tanggal_awal']);
    }
    if (isset($filters['tanggal_akhir']) && !empty($filters['tanggal_akhir'])) {
        $builder->where('transactions.tanggal_transaksi <=', $filters['tanggal_akhir']);
    }

    // Urutkan berdasarkan tanggal terbaru
    $builder->orderBy('transactions.tanggal_transaksi', 'DESC');
    $builder->orderBy('transactions.id', 'DESC');

    return $builder->get()->getResultArray();